ag.srm.2022.09.14.org


* Text Notes

  It's 7pm mountain time; do you know where your kids are? My kids are on their iPads or laptops, the 13 year old is probably playing a game or watching YouTube Videos and the 18 year old is probably on Discord or wattpad with their friends. Be honest; how many of you know what wattpad is? It doesn't really matter; for all I know the teenagers have moved on to something else by the time I'm talking to you. 

  But lets talk about the data: 

#+BEGIN_QUOTE

A recent study of 18-20-year-olds in the U.S. found that 71% experienced at least one online sexual harm during childhood. 

#+END_QUOTE

And then there is this

#+BEGIN_QUOTE

Among teens who reported suicidal thoughts, 13% of British users and 6% of American users traced the desire to kill themselves to Instagram, one presentation showed.

#+END_QUOTE

That second one is important for where it comes from and how we know it. This was an *internal* facebook research project that was *leaked* to the public and reported by the Washington Post. Facebook did the research, but they didn't release it themselves. That's bad. Keep this information in mind while I tell a short story that happened to my 13 year old 3 months ago when he was 12 still. 

We have a rule that he needs to get approval to watch any given youtube video. So he found one of a creator that does minecraft play videos. He asked if he could watch them; I sat down and watched 2 of them with him and gave him the ok. 

And that brings us to the elephant in the room with 111 million subscribers on youtube, the 4th largest channel on the platform and the number one largest individual channel. I'm not going to name his channel or him. But this individual has used racial slurs on his show, he's engaged in racist "pranks" on the gig website fiverr, and he's had guests including a prominent academic psychologist from Canada, who I also will not be naming. Notably he still has a channel and those 111 million subscribers.

Remember what I said about Instagram, which is owned by Facebook? These companies don't have our children's best interests in mind. That's just the facts. So it's up to us to look out for our children's safety.

There is no Justice; there is Just Us. 

So what can we do? We can put our core values of Kindness, Integrity, Passion! 

I am going to go out of order; 

Passion: be passionate about what your kids are into online! Talk *with* them about it; watch a minecraft let's play, I promise you the headache goes away. Know what they are doing! 

Integrity: We've all heard do as I say not as I do right? It's infuriating and it's dangerous. Be a good example for your children; show them how to use sites responsibly even when you think they aren't looking. And for goddess sake; use a password manager and teach your kids too! 

Kindness: One more data point before I end: 

#+BEGIN_QUOTE

85% of kids who had their intimate images used as blackmail online said they avoided seeking help due to embarrassment.

#+END_QUOTE

Your kids are going to make mistakes; so will you. How you handle those will determine your relationship and the outcomes more. Give them some some grace; we don't victim blame adults lets be double sure not to do it to our kids? 

Hail Hekate, She who holds the Keys.
Hail Hekate, She who lights the World.
Hail Hekate, She who stands at the Gate.

May I be brave enough to take up the key.
May I be committed enough to do the required work.
May I be strong enough to overcome all obstacles.

