ag.srm.2022.09.14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-14 Sun 10:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Steven Malins" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbd04d06">1. Text Notes</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbd04d06" class="outline-2">
<h2 id="orgbd04d06"><span class="section-number-2">1</span> Text Notes</h2>
<div class="outline-text-2" id="text-1">
<p>
It's 7pm mountain time; do you know where your kids are? My kids are on their iPads or laptops, the 13 year old is probably playing a game or watching YouTube Videos and the 18 year old is probably on Discord or wattpad with their friends. Be honest; how many of you know what wattpad is? It doesn't really matter; for all I know the teenagers have moved on to something else by the time I'm talking to you. 
</p>

<p>
But lets talk about the data: 
</p>

<blockquote>
<p>

</p>

<p>
A recent study of 18-20-year-olds in the U.S. found that 71% experienced at least one online sexual harm during childhood. 
</p>
</blockquote>

<p>
And then there is this
</p>

<blockquote>
<p>

</p>

<p>
Among teens who reported suicidal thoughts, 13% of British users and 6% of American users traced the desire to kill themselves to Instagram, one presentation showed.
</p>
</blockquote>

<p>
That second one is important for where it comes from and how we know it. This was an <b>internal</b> facebook research project that was <b>leaked</b> to the public and reported by the Washington Post. Facebook did the research, but they didn't release it themselves. That's bad. Keep this information in mind while I tell a short story that happened to my 13 year old 3 months ago when he was 12 still. 
</p>

<p>
We have a rule that he needs to get approval to watch any given youtube video. So he found one of a creator that does minecraft play videos. He asked if he could watch them; I sat down and watched 2 of them with him and gave him the ok. 
</p>

<p>
And that brings us to the elephant in the room with 111 million subscribers on youtube, the 4th largest channel on the platform and the number one largest individual channel. I'm not going to name his channel or him. But this individual has used racial slurs on his show, he's engaged in racist "pranks" on the gig website fiverr, and he's had guests including a prominent academic psychologist from Canada, who I also will not be naming. Notably he still has a channel and those 111 million subscribers.
</p>

<p>
Remember what I said about Instagram, which is owned by Facebook? These companies don't have our children's best interests in mind. That's just the facts. So it's up to us to look out for our children's safety.
</p>

<p>
There is no Justice; there is Just Us. 
</p>

<p>
So what can we do? We can put our core values of Kindness, Integrity, Passion! 
</p>

<p>
I am going to go out of order; 
</p>

<p>
Passion: be passionate about what your kids are into online! Talk <b>with</b> them about it; watch a minecraft let's play, I promise you the headache goes away. Know what they are doing! 
</p>

<p>
Integrity: We've all heard do as I say not as I do right? It's infuriating and it's dangerous. Be a good example for your children; show them how to use sites responsibly even when you think they aren't looking. And for goddess sake; use a password manager and teach your kids too! 
</p>

<p>
Kindness: One more data point before I end: 
</p>

<blockquote>
<p>

</p>

<p>
85% of kids who had their intimate images used as blackmail online said they avoided seeking help due to embarrassment.
</p>
</blockquote>

<p>
Your kids are going to make mistakes; so will you. How you handle those will determine your relationship and the outcomes more. Give them some some grace; we don't victim blame adults lets be double sure not to do it to our kids? 
</p>

<p>
Hail Hekate, She who holds the Keys.
Hail Hekate, She who lights the World.
Hail Hekate, She who stands at the Gate.
</p>

<p>
May I be brave enough to take up the key.
May I be committed enough to do the required work.
May I be strong enough to overcome all obstacles.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Steven Malins</p>
<p class="date">Created: 2022-08-14 Sun 10:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
